import pandas as pd
from tqdm import tqdm
import pykakasi


def create_kanji_dicts(df):
    kanji_dicts = []
    kanji = {}
    on = {}
    kun = {}

    for i in tqdm(range(len(df))):
        # 遍历所有行
        row = df.iloc[i]
        if pd.notna(row["号"]):
            if len(kanji) > 0:
                if len(on) > 0:
                    kanji["音读"].append(on)
                    on = {}
                if len(kun) > 0:
                    kanji["训读"].append(kun)
                    kun = {}
                kanji_dicts.append(kanji)
            kanji = {}
            on = {}
            kun = {}
            kanji["序号"] = int(row["号"])
            kanji["字"] = row["字"]
            kanji["汉检等级"] = row["漢検"]
            kanji["JIS水准"] = row["JIS"]
            kanji["学年"] = row["学年"]
            kanji["音读"] = []
            kanji["训读"] = []
        if pd.notna(row["本字"]):
            if len(on) > 0:
                kanji["音读"].append(on)
                on = {}

            on["字"] = row["本字"]
            on["拼音"] = row["拼音"]
            on["全部拼音"] = row["全部拼音"]
            on["小韵"] = row["小"]
            on["小韵序号"] = int(row["序"])
            on["声母"] = row["声"]
            on["韵摄"] = row["摄"]
            on["等"] = row["等"]
            on["呼"] = row["呼"]
            on["调"] = row["调"]
            on["韵系"] = row["系"]
            on["韵目"] = row["目"]
            on["韵母"] = row["母"]
            on["古韵罗马字"] = row["古韵"]
            on["推导普通话"] = row["推导"]
            on["音读"] = row["音训"]
            on["学级"] = row["学"]
            on["例词"] = row["例"]
            on["备考"] = row["备考"]
            on["备注"] = row["备注"]
            if pd.notna(row["吴音"]):
                on["吴音"] = True
            if pd.notna(row["汉音"]):
                on["汉音"] = True
            if pd.notna(row["吴汉"]) or pd.notna(row["吴音"]) and pd.notna(row["汉音"]):
                on["吴汉"] = True
            if pd.notna(row["唐音"]):
                on["唐音"] = True
            if pd.notna(row["惯用"]):
                on["惯用"] = True
        if not pd.notna(row["本字"]) and pd.notna(row["音训"]):
            if len(kun) > 0:
                kanji["训读"].append(kun)
                kun = {}
            kun["训读"] = row["音训"]
            kun["学级"] = row["学"]
            kun["例词"] = row["例"]
    if len(kanji) > 0:
        if len(on) > 0:
            kanji["音读"].append(on)
            on = {}
        if len(kun) > 0:
            kanji["训读"].append(kun)
            kun = {}
        kanji_dicts.append(kanji)
    return kanji_dicts


def find_jukuji(ji):
    jukuji = {
        "明": [("明日", "あす")],
        "日": [
            ("明日", "あす"),
            ("昨日", "きのう"),
            ("今日", "きょう"),
            ("二十日", "はつか"),
            ("日和", "ひより"),
            ("二日", "ふつか"),
            ("一日", "ついたち"),
        ],
        "為": [("為替", "かわせ")],
        "替": [("為替", "かわせ")],
        "小": [("小豆", "あずき")],
        "豆": [("小豆", "あずき")],
        "河": [("河原", "かわら"), ("河岸", "かし")],
        "原": [("河原", "かわら"), ("川原", "かわら"), ("海原", "うなばら")],
        "川": [("川原", "かわら")],
        "海": [("海女", "あま"), ("海士", "あま"), ("海原", "うなばら")],
        "女": [("海女", "あま"), ("早乙女", "さおとめ"), ("乙女", "おとめ")],
        "士": [("海士", "あま"), ("居士", "こじ"), ("博士", "はかせ")],
        "昨": [("昨日", "きのう")],
        "硫": [("硫黄", "いおう")],
        "黄": [("硫黄", "いおう")],
        "今": [("今日", "きょう"), ("今朝", "けさ"), ("今年", "ことし")],
        "意": [("意気地", "いくじ")],
        "気": [("意気地", "いくじ"), ("浮気", "うわき")],
        "地": [("意気地", "いくじ"), ("心地", "ここち")],
        "果": [("果物", "くだもの")],
        "物": [("果物", "くだもの")],
        "田": [("田舎", "いなか")],
        "舎": [("田舎", "いなか")],
        "玄": [("玄人", "くろうと")],
        "人": [
            ("玄人", "くろうと"),
            ("大人", "おとな"),
            ("素人", "しろうと"),
            ("一人", "ひとり"),
            ("二人", "ふたり"),
            ("仲人", "なこうど"),
            ("若人", "わこうど"),
        ],
        "息": [("息吹", "いぶき"), ("息子", "むすこ")],
        "吹": [("息吹", "いぶき"), ("吹雪", "ふぶき")],
        "朝": [("今朝", "けさ")],
        "景": [("景色", "けしき")],
        "色": [("景色", "けしき")],
        "乳": [("乳母", "うば")],
        "母": [
            ("乳母", "うば"),
            ("叔母", "おば"),
            ("伯母", "おば"),
            ("母屋", "おもや"),
            ("母家", "おもや"),
            ("母さん", "かあさん"),
        ],
        "心": [("心地", "ここち")],
        "浮": [("浮気", "うわき"), ("浮つく", "うわつく")],
        "居": [("居士", "こじ")],
        "年": [("今年", "ことし")],
        "笑": [("笑顔", "えがお")],
        "顔": [("笑顔", "えがお")],
        "早": [("早乙女", "さおとめ"), ("早苗", "さなえ")],
        "乙": [("早乙女", "さおとめ"), ("乙女", "おとめ")],
        "叔": [("叔父", "おじ"), ("叔母", "おば")],
        "父": [("叔父", "おじ"), ("伯父", "おじ"), ("父さん", "とうさん")],
        "伯": [("伯父", "おじ"), ("伯母", "おば")],
        "雑": [("雑魚", "ざこ")],
        "魚": [("雑魚", "ざこ")],
        "大": [("大人", "おとな"), ("大和", "やまと")],
        "桟": [("桟敷", "さじき")],
        "敷": [("桟敷", "さじき")],
        "差": [("差し支える", "さしつかえる")],
        "支": [("差し支える", "さしつかえる")],
        "五": [("五月", "さつき"), ("五月雨", "さみだれ")],
        "月": [("五月", "さつき"), ("五月雨", "さみだれ")],
        "巡": [("お巡りさん", "おまわりさん")],
        "苗": [("早苗", "さなえ")],
        "神": [("お神酒", "おみき"), ("神楽", "かぐら")],
        "酒": [("お神酒", "おみき")],
        "雨": [("五月雨", "さみだれ"), ("時雨", "しぐれ"), ("梅雨", "つゆ")],
        "屋": [
            ("母屋", "おもや"),
            ("数寄屋", "すきや"),
            ("数奇屋", "すきや"),
            ("部屋", "へや"),
            ("八百屋", "やおや"),
        ],
        "家": [("母家", "おもや")],
        "時": [("時雨", "しぐれ"), ("時計", "とけい")],
        "尻": [("尻尾", "しっぽ")],
        "尾": [("尻尾", "しっぽ")],
        "楽": [("神楽", "かぐら")],
        "竹": [("竹刀", "しない")],
        "刀": [("竹刀", "しない"), ("太刀", "たち")],
        "岸": [("河岸", "かし")],
        "老": [("老舗", "しにせ")],
        "舗": [("老舗", "しにせ")],
        "鍛": [("鍛冶", "かじ")],
        "冶": [("鍛冶", "かじ")],
        "芝": [("芝生", "しばふ")],
        "生": [("芝生", "しばふ"), ("弥生", "やよい")],
        "風": [("風邪", "かぜ")],
        "邪": [("風邪", "かぜ")],
        "清": [("清水", "しみず")],
        "水": [("清水", "しみず")],
        "固": [("固唾", "かたず")],
        "唾": [("固唾", "かたず")],
        "三": [("三味線", "しゃみせん")],
        "味": [("三味線", "しゃみせん")],
        "線": [("三味線", "しゃみせん")],
        "仮": [("仮名", "かな")],
        "名": [("仮名", "かな"), ("名残", "なごり")],
        "砂": [("砂利", "じゃり")],
        "利": [("砂利", "じゃり")],
        "蚊": [("蚊帳", "かや")],
        "帳": [("蚊帳", "かや")],
        "数": [("数珠", "じゅず"), ("数寄屋", "すきや"), ("数奇屋", "すきや")],
        "珠": [("数珠", "じゅず")],
        "上": [("上手", "じょうず")],
        "手": [("上手", "じょうず"), ("下手", "へた"), ("手伝う", "てつだう")],
        "祝": [("祝詞", "のりと")],
        "詞": [("祝詞", "のりと")],
        "白": [("白髪", "しらが")],
        "髪": [("白髪", "しらが")],
        "博": [("博士", "はかせ")],
        "素": [("素人", "しろうと")],
        "二": [
            ("二十", "はたち"),
            ("二十歳", "はたち"),
            ("二十日", "はつか"),
            ("二人", "ふたり"),
            ("二日", "ふつか"),
            ("十重二十重", "とえはたえ"),
        ],
        "十": [
            ("二十", "はたち"),
            ("二十歳", "はたち"),
            ("二十日", "はつか"),
            ("十重二十重", "とえはたえ"),
        ],
        "歳": [("二十歳", "はたち")],
        "師": [("師走", "しわす"), ("師走", "しはす")],
        "走": [("師走", "しわす"), ("師走", "しはす")],
        "寄": [("数寄屋", "すきや"), ("最寄り", "もより"), ("寄席", "よせ")],
        "奇": [("数奇屋", "すきや")],
        "波": [("波止場", "はとば")],
        "止": [("波止場", "はとば")],
        "場": [("波止場", "はとば")],
        "相": [("相撲", "すもう")],
        "撲": [("相撲", "すもう")],
        "一": [("一人", "ひとり"), ("一日", "ついたち")],
        "草": [("草履", "ぞうり")],
        "履": [("草履", "ぞうり")],
        "和": [("日和", "ひより"), ("大和", "やまと")],
        "山": [("山車", "だし"), ("築山", "つきやま")],
        "車": [("山車", "だし")],
        "太": [("太刀", "たち")],
        "立": [("立ち退く", "たちのく")],
        "退": [("立ち退く", "たちのく")],
        "雪": [("吹雪", "ふぶき"), ("雪崩", "なだれ")],
        "七": [("七夕", "たなばた")],
        "夕": [("七夕", "たなばた")],
        "下": [("下手", "へた")],
        "足": [("足袋", "たび")],
        "袋": [("足袋", "たび")],
        "部": [("部屋", "へや")],
        "稚": [("稚児", "ちご")],
        "児": [("稚児", "ちご")],
        "迷": [("迷子", "まいご")],
        "子": [("迷子", "まいご"), ("息子", "むすこ")],
        "真": [("真面目", "まじめ"), ("真っ赤", "まっか"), ("真っ青", "まっさお")],
        "面": [("真面目", "まじめ")],
        "目": [("真面目", "まじめ")],
        "築": [("築山", "つきやま")],
        "赤": [("真っ赤", "まっか")],
        "梅": [("梅雨", "つゆ")],
        "青": [("真っ青", "まっさお")],
        "凸": [("凸凹", "でこぼこ")],
        "凹": [("凸凹", "でこぼこ")],
        "土": [("土産", "みやげ")],
        "産": [("土産", "みやげ")],
        "伝": [("手伝う", "てつだう"), ("伝馬船", "てんません")],
        "馬": [("伝馬船", "てんません")],
        "船": [("伝馬船", "てんません")],
        "眼": [("眼鏡", "めがね")],
        "鏡": [("眼鏡", "めがね")],
        "投": [("投網", "とあみ")],
        "網": [("投網", "とあみ")],
        "猛": [("猛者", "もさ")],
        "者": [("猛者", "もさ")],
        "紅": [("紅葉", "もみじ")],
        "葉": [("紅葉", "もみじ")],
        "重": [("十重二十重", "とえはたえ")],
        "木": [("木綿", "もめん")],
        "綿": [("木綿", "もめん")],
        "読": [("読経", "どきょう")],
        "経": [("読経", "どきょう")],
        "最": [("最寄り", "もより")],
        "計": [("時計", "とけい")],
        "八": [("八百長", "やおちょう"), ("八百屋", "やおや")],
        "百": [("八百長", "やおちょう"), ("八百屋", "やおや")],
        "長": [("八百長", "やおちょう")],
        "友": [("友達", "ともだち")],
        "達": [("友達", "ともだち")],
        "仲": [("仲人", "なこうど")],
        "残": [("名残", "なごり")],
        "弥": [("弥生", "やよい")],
        "崩": [("雪崩", "なだれ")],
        "浴": [("浴衣", "ゆかた")],
        "衣": [("浴衣", "ゆかた")],
        "兄": [("兄さん", "にいさん")],
        "行": [("行方", "ゆくえ")],
        "方": [("行方", "ゆくえ")],
        "姉": [("姉さん", "ねえさん")],
        "席": [("寄席", "よせ")],
        "野": [("野良", "のら")],
        "良": [("野良", "のら")],
        "若": [("若人", "わこうど")],
    }
    
    return None if ji not in jukuji else jukuji[ji]


if __name__ == "__main__":

    kanjis = "分粉紛雰盆噴墳憤奮本奔門根墾懇恨痕肯恩任妊忍認人刃仁"

    df = pd.read_excel("./kanji/database7.xlsx")
    kanji_dicts = create_kanji_dicts(df)
    data_dict = {item["字"]: item for item in kanji_dicts}

    kks = pykakasi.kakasi()

    raw_text = ""
    for k in tqdm(kanjis):
        kanji = data_dict[k]

        raw_text += f"# {k}\n"
        if len(kanji["音读"]) > 0:
            for on in kanji["音读"]:
                if "吴音" in on:
                    raw_text += "[呉]"
                if "汉音" in on:
                    raw_text += "[漢]"
                if "惯用" in on:
                    raw_text += "[慣用]"
                raw_text += f'　{on["音读"]}\n'
                lici = on["例词"].split("、")
                for li in lici:
                    raw_text += f"{li}　"
                    result = kks.convert(li)
                    result = "　".join([it["hira"] for it in result])
                    raw_text += f"{result}\n"

            raw_text += "\n"
        raw_text += "[訓]\n"
        if len(kanji["训读"]) > 0:
            for kun in kanji["训读"]:
                lici = kun["例词"].split("、")
                for li in lici:
                    raw_text += f"{li}　"
                    result = kks.convert(li)
                    result = "　".join([it["hira"] for it in result])

                    # 如果末尾几位一样就顺便替换了
                    min_len = min(len(li), len(result))
                    count_kana_suffix = 0
                    while (
                        count_kana_suffix < min_len
                        and li[-(count_kana_suffix + 1)]
                        == result[-(count_kana_suffix + 1)]
                    ):
                        count_kana_suffix += 1
                    result = (
                        result[:-count_kana_suffix] + "-" * count_kana_suffix
                        if count_kana_suffix > 0
                        else result
                    )

                    raw_text += f"{result}\n"
        jukuji = find_jukuji(k)
        if jukuji is not None:
            raw_text += "[難読]\n"
            for j in jukuji:
                raw_text += f"{j[0]}　{j[1]}\n"
        raw_text += "\n"

    with open("./kanji/raw.md", "a", encoding="utf-8") as f:
        f.write(raw_text)
