# 汉字顺位

def jyuni_check(s: str):
    len_s = len(s)
    assert (len_s % 7 == 0)

    twice_list = []
    once_list = []
    # 教凸朝读A二ウ
    toppan_list = []
    asahi_list = []
    web_list = []
    kyouka_list = []

    target_lists = {
        0: kyouka_list,
        1: toppan_list,
        2: asahi_list,
        3: asahi_list,
        4: web_list,
        5: toppan_list,
        6: web_list,
    }

    for i in range(len_s // 7):
        for j in range(7):
            index = i * 7 + j
            kanji = s[index]
            if kanji in twice_list:
                continue
            target_list = target_lists.get(j)
            if kanji in target_list:
                continue
            target_list.append(kanji)
            if s[index] in once_list:
                once_list.remove(s[index])
                twice_list.append(kanji)
            once_list.append(kanji)
    return twice_list


s = "日人日日日国日" \
    "行一年年人人人" \
    "人日大大今大出" \
    "本大人人大年大" \
    "時年国国一地一" \
    "学出会会分日思" \
    "大本本本出本今" \
    "生中中中時中見" \
    "食子者月事生事" \
    "何見一事年政分" \
    "月国出出月会本" \
    "見言月一行一気" \
    "今上時者気民時" \
    "会分事時見化行" \
    "話生学分中業中" \
    "中手上上本的方" \
    "来自生生思世年" \
    "国行分同会自間" \
    "気者長長上立上" \
    "書二子学間代入" \
    "年間東子方法生" \
    "私事手後最動自" \
    "出思自手子戦言" \
    "物時同見前行会" \
    "事気見合言文前" \
    "一会合自生学子" \
    "間十後行入発手" \
    "子家社間新方合" \
    "電女前高自成場" \
    "手三間前手分作" \
    "語前高発的物来" \
    "前的発社無上感" \
    "入方業東私主後" \
    "分入市入合出私" \
    "先小場場来社回" \
    "車地田業場家用" \
    "上合入方円時的" \
    "曜後地内金東最" \
    "家目円今後権目" \
    "買長行市回事動" \
    "金場京対何間月" \
    "料代代新報制何" \
    "休私部的当教当" \
    "思下新部目合定" \
    "校立金円話第下" \
    "聞部目地感者物" \
    "友学対実情経者" \
    "理物立議高治体" \
    "言月内田動定新" \
    "部田回金下後無" \
    "所何政回笑内国" \
    "社来方目作力話" \
    "週彼今明国対発" \
    "新話的定発高食" \
    "字体議代業市部" \
    "強動勝選用産度" \
    "場社選相定子実" \
    "方知定立記界学" \
    "合理実員者条理" \
    "飲山員作食平高" \
    "好内相京社関全" \
    "使同朝政全山地" \
    "自心山力料軍使" \
    "円発北開学活記" \
    "店高約気女場通" \
    "高実戦北楽気楽" \
    "屋作力関長体内" \
    "毎当開体画済業" \
    "名新明決度新性" \
    "山世民性好部書" \
    "教今万連通長家" \
    "明書教理明海品" \
    "下度作小理多味" \
    "作明米教物開様" \
    "後五決取実府変" \
    "読戦体問部明良" \
    "口力小全店争持" \
    "番名表約先下社" \
    "勉金言言良金画" \
    "長性度勝体議力" \
    "道対通最連都先" \
    "漢意連戦不画多" \
    "地用最米家約明" \
    "持男安民期入長" \
    "水主理表内見取" \
    "動通性安味通笑" \
    "小関全山売義知" \
    "京文化家同用心" \
    "駅屋気主開現同" \
    "切感法当近天以" \
    "東郎家化地域近" \
    "意業関県結理対" \
    "仕定問通買道開" \
    "外政話動関和付" \
    "朝持主調書実外" \
    "楽道県法品連金" \
    "業外当保心書成" \
    "度取動話性図意" \
    "母所取要取朝関" \
    "病現保万小三小" \
    "田最野度成原所" \
    "二化現現名進女" \
    "近四下来知北面" \
    "室先点野美前少" \
    "帰民務下所月名" \
    "通身調思以農好" \
    "用不川党対島結" \
    "館口所朝田水報" \
    "住川用受変保情" \
    "女東都務持心数" \
    "十相来制安機真" \
    "味多外用初度不" \
    "体法受強多言考" \
    "画全区外付題立" \
    "院聞世所市外初" \
    "者情制意東資店" \
    "木野氏売外所山" \
    "文考知成様考化" \
    "安向党世数問料" \
    "少平強期株作現" \
    "父成期女予二法" \
    "火軍思記使近続" \
    "便開女文少南買" \
    "問教文校山同代" \
    "着経校持力結仕" \
    "土信成川仕工要" \
    "都近意数利際車" \
    "目以名指意変期" \
    "習語要経真公問" \
    "三面数区資西機" \
    "市連公題万調水" \
    "知問不以相表表" \
    "旅原以書続田市" \
    "回顔経公戦小切" \
    "達正続続現利能" \
    "形機島点法京色" \
    "多九持知代要加" \
    "海次書組番紀売" \
    "願数道不表土電" \
    "花美指都面全安" \
    "発回記首引領戦" \
    "員食首物終安道" \
    "転表多機投性連" \
    "内八物多有正相" \
    "音声題道昨手美" \
    "科水原加水意特" \
    "予報報鮮立集番" \
    "園真千正能形終" \
    "心味正報愛族可" \
    "開界先感考皇着" \
    "待無機原信川活" \
    "町少院名屋以田" \
    "親要初院主名予" \
    "薬海権心選語違" \
    "風変組権価統向" \
    "品結位初切神選" \
    "図切加第要数込" \
    "雨重産先電強強" \
    "定天画元車石屋" \
    "変神品向題章主" \
    "夜記心島決支文" \
    "受木界産第運世" \
    "表集元株着重教" \
    "全和重三集使聞" \
    "午員真利加働読" \
    "止引集品天期東" \
    "族公三設想不受" \
    "乗画向重込料状" \
    "川死男電強米題" \
    "運安木活達設調" \
    "天兵設協化党風" \
    "最親海面聞加達" \
    "色六利位格改次" \
    "真治鮮査在諸正" \
    "急決第和問品解" \
    "号太感画野字利" \
    "空氏判界京由確" \
    "四衛語男機目決" \
    "題強込込勝交愛" \
    "歩使支午朝労経" \
    "北込進支可次保" \
    "男朝村氏活広過" \
    "野受治海週共引" \
    "映島育必平境有" \
    "元解電認道有第" \
    "結市協育員基野" \
    "験期面進位来必" \
    "立様府治産展応" \
    "足村打考式流集" \
    "計活認木調太写" \
    "連頭水切帰王始" \
    "肉題近計色武原" \
    "売万半告他信二" \
    "早組使際特決素" \
    "歌仕投判教野点" \
    "利白考引世院元" \
    "線指活交経戸白" \
    "引説査近駅独他" \
    "活七交件公万身" \
    "送能和集約件重"

jyuni = jyuni_check(s)
print(''.join(jyuni))
